import { useState } from 'react'

import { Col, Container, Row } from 'react-bootstrap';
import { Button } from '../../../components';
import miladiToShamsi from '../../../boot/moment/_miladiToShamsi'

const UserPoint = () => {

    const sortItems = [
        {
            label: "ﺟﺪﯾﺪ ﺗﺮﯾﻦ دﯾﺪﮔﺎه ﻫﺎ",
            id: 0,
        },
        {
            label: "ﻣﻔﯿﺪ ﺗﺮﯾﻦ دﯾﺪﮔﺎه ﻫﺎ",
            id: 1,
        },
    ];
    const [activeSortItem, setActiveSortItem] = useState(sortItems[0].id);

    const fakeData = [
        {
            id: 0,
            text: "ﻟﻄﻔﺎ ﭘﯿﺶ از اﻧﺠﺎم ﻣﻌﺎﻣﻠﻪ و ﻫﺮ ﻧﻮع ﭘﺮداﺧﺖ وﺟﻪ، از ﺻﺤﺖ ﮐﺎﻟﺎ ﯾﺎ ﺧﺪﻣﺎت اراﺋﻪ ﺷﺪه، ﺑﻪ ﺻﻮرت ﺣﻀﻮری اﻃﻤﯿﻨﺎن ﺣﺎﺻﻞ ﻧﻤﺎﯾﯿﺪ. ﺑﺎ ﻣﻄﺎﻟﻌﻪ‌ی راﻫﻨﻤﺎی ﺧﺮﯾﺪ اﻣﻦ، آﺳﻮده‌ﺗﺮ ﻣﻌﺎﻣﻠﻪ ﮐﻨﯿﺪ.",
            date: new Date(),
            name: "هداز ﯽﯾﺎﻗآ ﯽﻠﻋ",
            src: "https://picsum.photos/id/237/200/300",
            like: 2,
            disLike: 0,
        },
        {
            id: 2,
            text: "یرﻮﻀﺣ ترﻮﺻ ﻪﺑ ،هﺪﺷ ﻪﺋارا تﺎﻣﺪﺧ ﺎﯾ ﺎﻟﺎﮐ ﺖﺤﺻ زا ،ﻪﺟو ﺖﺧادﺮﭘ عﻮﻧ ﺮﻫ و ﻪﻠﻣﺎﻌﻣ مﺎﺠﻧا زا ﺶﯿﭘ ﺎﻔﻄﻟ.ﺪﯿﻨﮐ ﻪﻠﻣﺎﻌﻣ ﺮﺗ‌هدﻮﺳآ ،ﻦﻣا ﺪﯾﺮﺧ یﺎﻤﻨﻫار ی‌ﻪﻌﻟﺎﻄﻣ ﺎﺑ .ﺪﯿﯾﺎﻤﻧ ﻞﺻﺎﺣ نﺎﻨﯿﻤﻃا",
            date: new Date(),
            name: "امیر ولی پوری",
            src: "https://picsum.photos/id/237/200/300",
            like: 2,
            disLike: 0,
        }
    ]
    return (
        <div>
            <div className="d-lg-flex justify-content-between align-items-center px-1 py-2" xs="12" lg="12">
                <p className="fs-20 fw-700 text-primary m-1">دﯾﺪﮔﺎه ﮐﺎرﺑﺮان</p>
                <Button className="m-1" outline={true} label="ﺛﺒﺖ دﯾﺪﮔﺎه ﺟﺪﯾﺪ" />
            </div>
            <div className="sort-items-section my-5 d-flex align-items-center col-gap-5 overflow-auto p-3">
                <h6 className="text-info lh-normal m-0 white-space-nowrap">
                    ﻣﺮﺗﺐ ﺳﺎزی دﯾﺪﮔﺎه‌ﻫﺎ ﺑﺮ اﺳﺎس:
                </h6>
                {sortItems.map((item) => (
                    <button
                        key={item.id}
                        onClick={() => setActiveSortItem(item.id)}
                        className={`position-relative white-space-nowrap px-1 py-2 border-0 transition ${activeSortItem === item.id ? "active text-info" : "text-secondary"
                            }`}
                    >
                        {item.label}
                    </button>
                ))}
            </div>
            <Row className="align-items-stretch">
                {fakeData.map((item, index) =>
                    <Row key={index} className="w-100 h-auto d-flex align-items-start " >
                        <Col className="d-flex justify-content-start justify-content-lg-end" xs="12" lg="1">
                            <img className="rounded-circle" width="41" height="41" src={item.src} />
                        </Col>
                        <Col xs="12" lg="11">
                            <div className="d-flex justify-content-between align-items-center ">
                                <div className='d-flex'>

                                    <div className="">
                                        <p className='fs-14 fw-400 text-black'>{item.name}</p>
                                        <p className='fs-12 fw-400 my-1'>{miladiToShamsi(item.date)}</p>
                                    </div>
                                </div>
                                <div className="d-flex">
                                    <span className="bi bi-star-fill text-gray mr-1"></span>
                                    {[1, 2, 3, 4].map((item, index) =>
                                        <span key={index} className="bi bi-star-fill text-primary mx-1"></span>
                                    )}

                                </div>
                            </div>

                            <p className="fs-16 fw-400 text-black ">{item.text}</p>
                            <div className="w-100 d-flex justify-content-center justify-content-lg-end align-items-center">
                                <div className="d-flex justify-content-between align-items-center">
                                    <p className="fs-14 fw-400">آیا این دیدگاه برایتان مفید بود!؟</p>
                                    <span className="mx-2 fs-14 text-gray fw-400">
                                        {item.like}
                                        <svg className="mx-1" width="14" height="16" viewBox="0 0 14 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M14 9.50003C14 9.09937 13.8606 8.72603 13.6202 8.45069C13.8927 8.11003 14.0315 7.65334 13.9936 7.17803C13.9253 6.33069 13.2574 5.66669 12.4722 5.66669H8.869C9.0475 5.04734 9.33332 3.91203 9.33332 3.00003C9.33332 1.55403 8.25825 0.333374 7.58332 0.333374C6.97782 0.333374 6.5444 0.723374 6.52632 0.739374C6.4569 0.802718 6.41665 0.898718 6.41665 1.00003V3.26069L4.73607 7.42003L4.66665 7.46069V7.33334C4.66665 7.14934 4.53597 7 4.37497 7H1.45832C0.653926 7.00003 0 7.74737 0 8.66669V14C0 14.9194 0.653926 15.6667 1.45832 15.6667H3.20832C3.8389 15.6667 4.3779 15.2067 4.5809 14.5647C5.06625 14.85 5.71957 15 6.125 15H11.4794C12.1147 15 12.6706 14.5107 12.8013 13.836C12.8683 13.488 12.8293 13.138 12.6962 12.834C13.1267 12.5867 13.4167 12.078 13.4167 11.5C13.4167 11.264 13.3694 11.038 13.2802 10.834C13.7107 10.586 14 10.078 14 9.50003ZM12.7697 10.3227C12.6572 10.338 12.5621 10.4253 12.5259 10.5487C12.4904 10.672 12.5201 10.8073 12.6029 10.8967C12.7511 11.056 12.8334 11.2707 12.8334 11.5C12.8334 11.9207 12.5551 12.274 12.187 12.3227C12.0745 12.338 11.9794 12.4253 11.9432 12.5487C11.9076 12.672 11.9374 12.8073 12.0202 12.8967C12.2121 13.1033 12.2891 13.3933 12.2314 13.692C12.1596 14.064 11.8435 14.3334 11.4795 14.3334H6.125C5.65132 14.3334 4.85682 14.0794 4.5815 13.764C4.49807 13.6694 4.37207 13.6414 4.26357 13.692C4.1545 13.7434 4.08332 13.8654 4.08332 14C4.08332 14.5514 3.69075 15 3.20832 15H1.45832C0.975898 15 0.583324 14.5514 0.583324 14V8.66669C0.583324 8.11534 0.975898 7.66669 1.45832 7.66669H4.08332V8.00003C4.08332 8.11537 4.13582 8.22269 4.22215 8.28403C4.30732 8.34269 4.41465 8.34869 4.50565 8.29803L5.08897 7.96469C5.1479 7.93134 5.19515 7.87534 5.22315 7.80669L6.97315 3.47334C6.99065 3.42934 6.99997 3.38134 6.99997 3.33334V1.18069C7.12132 1.10403 7.33193 1.00003 7.58332 1.00003C7.903 1.00003 8.75 1.90803 8.75 3.00003C8.75 4.17337 8.19118 5.86469 8.18593 5.88137C8.1521 5.98337 8.16375 6.09872 8.218 6.18937C8.27282 6.27937 8.36268 6.33337 8.45832 6.33337H12.4722C12.9587 6.33337 13.3717 6.73137 13.4126 7.23937C13.4435 7.61937 13.2836 7.98072 12.9972 8.18272C12.908 8.24537 12.8549 8.35872 12.859 8.47937C12.8631 8.60003 12.9237 8.70803 13.0171 8.76337C13.2638 8.90672 13.4166 9.18937 13.4166 9.50003C13.4167 9.92069 13.1384 10.274 12.7697 10.3227Z" fill="#909090" />
                                        </svg>

                                    </span>

                                    <span className="mx-2 fs-14 fw-400 text-gray">
                                        {item.disLike}
                                        <svg className="mx-1" width="14" height="16" viewBox="0 0 14 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M2.4509e-07 6.5C2.76061e-07 6.90066 0.139427 7.274 0.379751 7.54934C0.107325 7.89 -0.0315004 8.34669 0.00642533 8.822C0.0746761 9.66934 0.742602 10.3333 1.52775 10.3333L5.131 10.3333C4.9525 10.9527 4.66668 12.088 4.66668 13C4.66668 14.446 5.74175 15.6667 6.41668 15.6667C7.02218 15.6667 7.4556 15.2767 7.47368 15.2607C7.5431 15.1973 7.58335 15.1013 7.58335 15L7.58335 12.7393L9.26393 8.58L9.33335 8.53934L9.33335 8.66669C9.33335 8.85069 9.46403 9.00003 9.62503 9.00003L12.5417 9.00003C13.3461 9 14 8.25266 14 7.33334L14 2C14 1.08065 13.3461 0.333342 12.5417 0.333342L10.7917 0.333342C10.1611 0.333342 9.6221 0.793342 9.4191 1.43534C8.93375 1.15 8.28042 0.999999 7.875 0.999999L2.52057 0.999999C1.88532 0.999999 1.3294 1.48934 1.19875 2.164C1.13168 2.512 1.17075 2.862 1.30375 3.166C0.87325 3.41334 0.583324 3.922 0.583325 4.5C0.583325 4.736 0.630574 4.962 0.719825 5.166C0.289325 5.414 2.00411e-07 5.922 2.4509e-07 6.5ZM1.23025 5.67734C1.34282 5.662 1.43793 5.57469 1.47407 5.45134C1.50965 5.328 1.4799 5.19269 1.39707 5.10334C1.2489 4.944 1.16665 4.72934 1.16665 4.5C1.16665 4.07934 1.4449 3.726 1.81297 3.67734C1.92555 3.662 2.02065 3.57469 2.0568 3.45134C2.09237 3.328 2.06262 3.19269 1.9798 3.10334C1.78787 2.89669 1.71087 2.60669 1.76862 2.308C1.84037 1.936 2.15655 1.66666 2.52055 1.66666L7.875 1.66666C8.34868 1.66666 9.14318 1.92065 9.4185 2.236C9.50192 2.33066 9.62792 2.35865 9.73642 2.308C9.8455 2.25665 9.91667 2.13466 9.91667 2C9.91667 1.44865 10.3092 0.999998 10.7917 0.999998L12.5417 0.999998C13.0241 0.999998 13.4167 1.44865 13.4167 2L13.4167 7.33334C13.4167 7.88469 13.0241 8.33334 12.5417 8.33334L9.91668 8.33334L9.91668 8C9.91668 7.88466 9.86418 7.77734 9.77785 7.716C9.69268 7.65734 9.58535 7.65134 9.49435 7.702L8.91103 8.03534C8.8521 8.06869 8.80485 8.12469 8.77685 8.19334L7.02685 12.5267C7.00935 12.5707 7.00003 12.6187 7.00003 12.6667L7.00003 14.8193C6.87868 14.896 6.66807 15 6.41668 15C6.097 15 5.25 14.092 5.25 13C5.25 11.8267 5.80882 10.1353 5.81407 10.1187C5.8479 10.0167 5.83625 9.90131 5.782 9.81066C5.72718 9.72066 5.63732 9.66666 5.54168 9.66666L1.52775 9.66666C1.04125 9.66666 0.628251 9.26866 0.587427 8.76066C0.556501 8.38066 0.716352 8.01931 1.00275 7.81731C1.092 7.75466 1.14507 7.64131 1.141 7.52066C1.13693 7.4 1.07625 7.292 0.982926 7.23666C0.736176 7.09331 0.583352 6.81066 0.583352 6.5C0.583325 6.07934 0.861574 5.726 1.23025 5.67734Z" fill="#909090" />
                                        </svg>


                                    </span>
                                </div>
                            </div>
                        </Col>



                        <hr />
                    </Row>

                )}
            </Row>
        </div>
    )
}

export default UserPoint